#===istalismanplugin===
# -*- coding: utf-8 -*-

def poem(type, source, body):
    q = [u'Я помню',u'Не помню',u'Забыть бы',u'Купите',u'Очкуешь',u'Какое',u'Угробил',u'Открою',u'Ты чуешь?']
    w = [u'чудное',u'странное',u'некое',u'вкусное',u'пьяное',u'свинское',u'чоткое',u'сраное',u'нужное',u'конское']
    e = [u'мгновенье,',u'затменье,',u'хотенье,',u'варенье,',u'творенье,',u'везенье,',u'рожденье,',u'смущенье,',u'печенье,',u'ученье,']
    r = [u'\n']
    t = [u'передомной',u'под косячком',u'на кладбище',u'в моих мечтах',u'под скальпилем',u'в моих штанах',u'из-за угла',u'в моих ушах',u'в ночном горшке',u'из головы']
    y = [u'явилась ты,',u'добилась ты,',u'торчат кресты,',u'стихов листы,',u'забилась ты,',u'мои трусы,',u'поют дрозды,',u'из темноты,',u'помылась ты,',u'дают пизды,']
    u = [u'как']
    i = [u'мимолётное',u'детородное',u'психотропное',u'кайфоломное',u'очевидное',u'у воробушков',u'эдакое вот',u'нам не чуждое',u'благородное',u'ябывдульское']
    o = [u'виденье,',u'сиденье,',u'паренье,',u'сужденье,',u'вращенье,',u'сношенье,',u'смятенье,',u'теченье,',u'паденье,',u'сплетенье,']
    p = [u'гений',u'сторож',u'символ',u'спарта',u'правда',u'ангел',u'водка',u'пиво',u'ахтунг',u'жопа']
    a = [u'чистой',u'вечной',u'тухлой',u'просит',u'грязной',u'липкой',u'на хрен',u'в пене',u'женской',u'жаждет']
    s = [u'красоты',u'мерзлоты',u'суеты',u'наркоты',u'срамоты',u'школоты',u'типа ты',u'простоты',u'хуеты',u'наготы']
    mes = random.choice(q)
    mes1 = random.choice(w)
    mes2 = random.choice(e)
    mes3 = random.choice(r)
    mes4 = random.choice(t)
    mes5 = random.choice(y)
    mes6 = random.choice(r)
    mes7 = random.choice(u)
    mes8 = random.choice(i)
    mes9 = random.choice(o)
    mes10 = random.choice(r)
    mes11 = random.choice(p)
    mes12 = random.choice(a)
    mes13 = random.choice(s)
    reply(type,source,u'   '+str(mes)+' '+str(mes1)+' '+str(mes2)+' '+str(mes3)+' '+str(mes4)+' '+str(mes5)+' '+str(mes6)+' '+str(mes7)+' '+str(mes8)+' '+str(mes9)+' '+str(mes10)+' '+str(mes11)+' '+str(mes12)+' '+str(mes13)+'')

register_command_handler(poem, 'поэма', [], 10, 'Сочиняет поэму.', 'поэма', ['поэма'])